openfoam2412-cases/vortexShed/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
                             
                     
scale   0.02;

vertices
(
    (0 0 -1)  // pt 0 (p0f) 
    (8.5857864376 0 -1)  // pt 1 (p1f) 
    (11.4142135624 0 -1)  // pt 2 (p2f) 
    (40 0 -1)  // pt 3 (p3f) 
    (40 13.5857864376 -1)  // pt 4 (p4f) 
    (40 16.4142135624 -1)  // pt 5 (p5f) 
    (40 30 -1)  // pt 6 (p6f) 
    (11.4142135624 30 -1)  // pt 7 (p7f) 
    (8.5857864376 30 -1)  // pt 8 (p8f) 
    (0 30 -1)  // pt 9 (p9f) 
    (0 16.4142135624 -1)  // pt 10 (p10f) 
    (0 13.5857864376 -1)  // pt 11 (p11f) 
    (8.5857864376 13.5857864376 -1)  // pt 12 (p12f) 
    (11.4142135624 13.5857864376 -1)  // pt 13 (p13f) 
    (11.4142135624 16.4142135624 -1)  // pt 14 (p14f) 
    (8.5857864376 16.4142135624 -1)  // pt 15 (p15f) 
    (9.2928932188 14.2928932188 -1)  // pt 16 (p16f) 
    (10.7071067812 14.2928932188 -1)  // pt 17 (p17f) 
    (10.7071067812 15.7071067812 -1)  // pt 18 (p18f) 
    (9.2928932188 15.7071067812 -1)  // pt 19 (p19f) 

    (0 0 0)  // pt 20 (p0b) 
    (8.5857864376 0 0)  // pt 21 (p1b) 
    (11.4142135624 0 0)  // pt 22 (p2b) 
    (40 0 0)  // pt 23 (p3b) 
    (40 13.5857864376 0)  // pt 24 (p4b) 
    (40 16.4142135624 0)  // pt 25 (p5b) 
    (40 30 0)  // pt 26 (p6b) 
    (11.4142135624 30 0)  // pt 27 (p7b) 
    (8.5857864376 30 0)  // pt 28 (p8b) 
    (0 30 0)  // pt 29 (p9b) 
    (0 16.4142135624 0)  // pt 30 (p10b) 
    (0 13.5857864376 0)  // pt 31 (p11b) 
    (8.5857864376 13.5857864376 0)  // pt 32 (p12b) 
    (11.4142135624 13.5857864376 0)  // pt 33 (p13b) 
    (11.4142135624 16.4142135624 0)  // pt 34 (p14b) 
    (8.5857864376 16.4142135624 0)  // pt 35 (p15b) 
    (9.2928932188 14.2928932188 0)  // pt 36 (p16b) 
    (10.7071067812 14.2928932188 0)  // pt 37 (p17b) 
    (10.7071067812 15.7071067812 0)  // pt 38 (p18b) 
    (9.2928932188 15.7071067812 0)  // pt 39 (p19b) 
);

blocks
(
    // 0
    hex (0 1 12 11 20 21 32 31)
    ( 120 80 1 ) simpleGrading (1 0.2 1)

    // 1
    hex (1 2 13 12 21 22 33 32)
    ( 40 80 1 ) simpleGrading (1 0.2 1)

    // 2
    hex (2 3 4 13 22 23 24 33)
    ( 400 80 1 ) simpleGrading (1 0.2 1)

    // 3
    hex (13 4 5 14 33 24 25 34)
    ( 400 40 1 ) simpleGrading (1 1 1)

    // 4
    hex (14 5 6 7 34 25 26 27)
    ( 400 80 1 ) simpleGrading (1 5 1)

    // 5
    hex (15 14 7 8 35 34 27 28)
    ( 40 80 1 ) simpleGrading (1 5 1)

    // 6
    hex (10 15 8 9 30 35 28 29)
    ( 120 80 1 ) simpleGrading (1 5 1)

    // 7
    hex (11 12 15 10 31 32 35 30)
    ( 120 40 1 ) simpleGrading (1 1 1)

    // 8
    hex (12 16 19 15 32 36 39 35)
    ( 80 40 1 ) simpleGrading (0.025 1 1)

    // 9
    hex (12 13 17 16 32 33 37 36)
    ( 40 80 1 ) simpleGrading (1 0.025 1)

    // 10
    hex (17 13 14 18 37 33 34 38)
    ( 80 40 1 ) simpleGrading (40 1 1)

    // 11
    hex (19 18 14 15 39 38 34 35)
    ( 40 80 1 ) simpleGrading (1 40 1)
);

edges
(
    // Inner circle
    arc  16 17 (10 14 -1)
    arc  17 18 (11 15 -1)
    arc  18 19 (10 16 -1)
    arc  19 16 (9 15 -1)

    arc  36 37 (10 14 0)
    arc  37 38 (11 15 0)
    arc  38 39 (10 16 0)
    arc  39 36 (9 15 0)

    // Outer circle
    arc  12 13 (10 13 -1)
    arc  13 14 (12 15 -1)
    arc  14 15 (10 17 -1)
    arc  15 12 (8 15 -1)

    arc  32 33 (10 13 0)
    arc  33 34 (12 15 0)
    arc  34 35 (10 17 0)
    arc  35 32 (8 15 0)
);

defaultPatch
{
    name    frontAndBack;
    type    empty;
}

boundary
(
    inlet
    {
        type        patch;
        faces
        (
            (9 29 30 10)
            (10 30 31 11)
            (11 31 20 0)
        );
    }
    outlet
    {
        type        patch;
        faces
        (
            (3 23 24 4)
            (4 24 25 5)
            (5 25 26 6)
        );
    }

    cylinder
    {
        type        wall;
        faces
        (
            (16 36 37 17)
            (17 37 38 18)
            (18 38 39 19)
            (19 39 36 16)
        );
    }

    top
    {
        type        patch;
        faces
        (
            (6 26 27 7)
            (7 27 28 8)
            (8 28 29 9)
        );
    }

    bottom
    {
        type        patch;
        faces
        (
            (0 20 21 1)
            (1 21 22 2)
            (2 22 23 3)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
